# Ultralytics YOLO11s - research variant with C3k2 backbone and C2PSA
# Backbone: Conv -> Conv -> C3k2 -> Conv -> C3k2 -> Conv -> C3k2 -> Conv -> C3k2 -> SPPF -> C2PSA

# Parameters
nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLO11s backbone (C2f replaced with C3k2, C2PSA after SPPF)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 3, C3k2, [128, True]]       # 2
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 6, C3k2, [256, True]]       # 4
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 6, C3k2, [512, True]]       # 6
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 3, C3k2, [1024, True]]      # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9
  - [-1, 1, C2PSA, [1024]]           # 10

# Head (unchanged; uses C2f in neck)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]   # cat head P4 with backbone P5 (C2PSA)
  - [-1, 3, C2f, [1024]]
  - [[15, 18, 21], 1, Detect, [nc]]
